app/controllers/authentications_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'ctiv@hotmail.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def linkedin
    omni = request.env["omniauth.auth"]
    Rails.logger.debug("My omni object: #{omni.inspect}")
    registered = User.find_by_email(omni['info']['email'])

    if registered # this section simply logs in a user who has authenticated with LI before
      sign_in_and_redirect User.find(registered.id)

    else # this section is for a user who has not yet registered for Partake and is using LI to do so
      user = User.new
      user.first_name = omni['info']['first_name']
      user.last_name = omni['info']['last_name']
      user.email = omni['info']['email']
      user.apply_omniauth(omni)

      if user.save